---
kind: type
id: T:Autodesk.Revit.DB.Visual.AdvancedLayered
source: html/308d3112-a63f-0c76-7737-8cf201454790.htm
---
# Autodesk.Revit.DB.Visual.AdvancedLayered

A static class that provides access to the property names that appear in the AdvancedLayered visual asset schema.

## Syntax (C#)
```csharp
public static class AdvancedLayered
```